app/views/articles/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1  ORDER BY created_at DESC
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
		<ul>
			<% @article.comments.order("created_at DESC").each do |comment| %>
				<hr><p>
					<%if comment.user.photo.present?%>