app/views/topics/index.html.erb

					<td><%= link_to '<i class="glyphicon glyphicon-circle-arrow-right"></i> '.html_safe+topic.title, topic %></td>
					<td><%= topic.articles.count %></td>
---
SELECT COUNT(*) FROM `articles` WHERE `articles`.`topic_id` = 1