app/views/events/show.html.erb

					<p>
						<%if event_comment.user.photo.present?%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1