app/controllers/administration_controller.rb

SELECT `finances`.* FROM `finances`
---
	def cuentas
		add_breadcrumb "Cuentas claras", :administration_cuentas_path
		@finances = Finance.all