app/controllers/administration_controller.rb

SELECT `portals`.* FROM `portals` WHERE (section = 1)
---
	def noticias
		add_breadcrumb "Noticias", :administration_noticias_path
		@portals = Portal.where("section = ?", 1)

SELECT `portals`.* FROM `portals` WHERE (section = 3)
---
	def coneib
		add_breadcrumb "CONEIB", :administration_coneib_path
		@portals = Portal.where("section = ?", 3)

SELECT `topics`.* FROM `topics`
---
	def topicos
		@topics = Topic.all