app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
    @articles = Article.all

INSERT INTO `articles` (`topic_id`, `title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES (1, 'articulo 1', 'asdasdasdasdsadad', 1, '2016-07-26 21:11:36', '2016-07-26 21:11:36')
---
  def create
    @article = current_user.articles.new(article_params)
    @article.topic_id = @topic.id

    respond_to do |format|
      if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
    def set_article
      @article = Article.find(params[:id])

SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 3 LIMIT 1
---
    def set_topic
      @topic = Topic.find(params[:topic_id])