app/controllers/articles_controller.rb

	def show
		add_breadcrumb @topic.title, @topic
		add_breadcrumb @article.title
		@comment = Comment.new
		@comments = @article.comments.paginate(:page => params[:page], :per_page => 10).order("created_at DESC")
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1  ORDER BY created_at DESC