app/controllers/comments_controller.rb

INSERT INTO `comments` (`body`, `user_id`, `article_id`, `created_at`, `updated_at`) VALUES ('asdasda', 1, 3, '2016-07-26 21:20:40', '2016-07-26 21:20:40')
---
	def create
		@comment = current_user.comments.new(comment_params)
		@comment.article = @article

		respond_to do |format|
			if @comment.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
		def set_article
			@article = Article.find(params[:article_id])