app/controllers/contacts_controller.rb

INSERT INTO `contacts` (`name`, `email`, `subject`, `body`, `created_at`, `updated_at`) VALUES ('Paz Bustos Mena', 'paz.bustos.m@gmail.com', 'Prueba 4', 'Desde producción local!', '2016-08-02 18:20:37', '2016-08-02 18:20:37')
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save