app/controllers/events_controller.rb

SELECT `events`.* FROM `events` WHERE `events`.`status` = 1
---
	def index
		@events = Event.where(status: 1)

INSERT INTO `events` (`title`, `address`, `description`, `start_time`, `end_time`, `user_id`, `status`, `created_at`, `updated_at`) VALUES ('Evento Ejemplo', 'Este es un evetnto ejemplo', 'asdasda asdsadasd asdsadasdasdas', '2016-07-26 18:26:00', '2016-07-26 18:26:00', 1, '1', '2016-07-26 18:27:21', '2016-07-26 18:27:21')
---
	def create
		@event = current_user.events.new(event_params)
		respond_to do |format|
			if @event.save

SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
		def set_event
			@event = Event.find(params[:id])