app/controllers/finances_controller.rb

  def index
    @finances = Finance.all
---
SELECT `finances`.* FROM `finances`