app/controllers/interest_links_controller.rb

SELECT `interest_links`.* FROM `interest_links`
---
	def index
	@interest_links = InterestLink.all

INSERT INTO `interest_links` (`name`, `url`, `description`, `created_at`, `updated_at`) VALUES ('Facebook', 'www.facebook.com', 'Nuestro Face!!!', '2016-07-27 20:22:14', '2016-07-27 20:22:14')
---
	def create
		@interest_link = InterestLink.new(interest_link_params)
		respond_to do |format|
			if @interest_link.save

UPDATE `interest_links` SET `url` = 'http://www.facebook.com', `description` = '<p>Nuestro Face!!!</p>', `updated_at` = '2016-07-27 20:39:04' WHERE `interest_links`.`id` = 1
---
	def update
		respond_to do |format|
			if @interest_link.update(interest_link_params)

SELECT  `interest_links`.* FROM `interest_links` WHERE `interest_links`.`id` = 1 LIMIT 1
---
		def set_interest_link
			@interest_link = InterestLink.find(params[:id])