app/controllers/organizations_controller.rb

SELECT `organizations`.* FROM `organizations`
---
	def index
	@organizations = Organization.all