app/controllers/portals_controller.rb

  def index
    @portals = Portal.where("section = ?", 1)
---
SELECT `portals`.* FROM `portals` WHERE (section = 1)

  def create
    @portal = current_user.portals.new(portal_params)
    respond_to do |format|
      if @portal.save
---
INSERT INTO `portals` (`title`, `body`, `section`, `user_id`, `created_at`, `updated_at`) VALUES ('Noticia 1', '<p>quiero ver el bootstrap flash!<em>asdasdas</em></p>', 1, 1, '2016-07-26 19:17:26', '2016-07-26 19:17:26')

  def destroy
    @portal.destroy
---
DELETE FROM `portals` WHERE `portals`.`id` = 1

  def somos
    add_breadcrumb "Quiénes somos", :portals_somos_path
    @portals = Portal.where("section = ?", 2)
---
SELECT `portals`.* FROM `portals` WHERE (section = 2)

  def coneib
    add_breadcrumb "CONEIB", :portals_coneib_path
    @portals = Portal.where("section = ?", 3)
---
SELECT `portals`.* FROM `portals` WHERE (section = 3)

  def estatuto
    add_breadcrumb "Estatuto", :portals_estatuto_path
    @portals = Portal.order("title ASC").where("section = ?", 4)
---
SELECT `portals`.* FROM `portals` WHERE (section = 4)  ORDER BY title ASC

    def set_portal
      @portal = Portal.find(params[:id])
---
SELECT  `portals`.* FROM `portals` WHERE `portals`.`id` = 1 LIMIT 1