app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics`
---
  def index
    @topics = Topic.all