app/controllers/topics_controller.rb

SELECT `topics`.* FROM `topics` WHERE `topics`.`status` = 1
---
  def index
    @topics = Topic.where(status: 1)

SELECT `articles`.* FROM `articles` WHERE `articles`.`topic_id` = 1  ORDER BY created_at DESC
---
  def show
    @articles = @topic.articles.all

INSERT INTO `topics` (`title`, `description`, `user_id`, `status`, `created_at`, `updated_at`) VALUES ('quinto tema', '<p>alsdaslkdjasjdkjlassd</p>', 1, 1, '2016-07-27 19:57:50', '2016-07-27 19:57:50')
---
  def create
    @topic = current_user.topics.new(topic_params)
    @topic.status = 1
    respond_to do |format|
      if @topic.save

UPDATE `topics` SET `description` = '<p><strong>Este es un topico de jeemplo <span style=\"color: rgb(84, 172, 210);\">asdasdasdsadas</span></strong></p>', `updated_at` = '2016-07-26 23:05:08' WHERE `topics`.`id` = 1
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1
---
    def set_topic
      @topic = Topic.find(params[:id])