app/controllers/users_controller.rb

	def set_user
		@user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1